app/Controllers/User.php

    public function account()
    {
        $login_user_id = user()->id;
        $userInfo = $this->userModel->where(['id' => $login_user_id])->first();
---
SELECT *
FROM `users`
WHERE `id` = '10'
 LIMIT 1